scripts/sartorious/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "5e-05/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    outlet
    {
        type            patch;
        nFaces          432;
        startFace       44958;
    }
    propeller
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3192;
        startFace       45390;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3356;
        startFace       48582;
    }
    inside_to_hub
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       51938;
    }
    inside_to_hub_copy
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       51938;
    }
    hub_to_rotor
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       51938;
    }
    hub_to_rotor_copy
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       51938;
    }
    inlet
    {
        type            patch;
        nFaces          304;
        startFace       51938;
    }
)

// ************************************************************************* //
